namespace WorldGeneration.Generation
{
    public static class MarchingSquaresLookUpTables
    {
        // Сколько ТРЕУГОЛЬНИКОВ на маску (верхняя крышка):
        public static readonly int[] TriangleCount =
        {
            /*0*/0, /*1*/1, /*2*/1, /*3*/2, /*4*/1, /*5*/2, /*6*/2, /*7*/3,
            /*8*/1, /*9*/2, /*10*/2, /*11*/3, /*12*/2, /*13*/3, /*14*/3, /*15*/2
        };

        // Какие УГЛЫ используются (битовая маска: v00=1, v10=2, v01=4, v11=8)
        public static readonly int[] CornerMask =
        {
            /*0*/0b0000, /*1*/0b0001, /*2*/0b0010, /*3*/0b0011,
            /*4*/0b0100, /*5*/0b0101, /*6*/0b0110, /*7*/0b0111,
            /*8*/0b1000, /*9*/0b1001, /*10*/0b1010, /*11*/0b1011,
            /*12*/0b1100, /*13*/0b1101, /*14*/0b1110, /*15*/0b1111
        };

        // Какие РЁБРА нужны (битовая маска: Left=1, Right=2, Top=4, Bottom=8)
        public static readonly int[] EdgeMask =
        {
            /*0*/0b0000, /*1*/0b1001, /*2*/0b1010, /*3*/0b0011,
            /*4*/0b0101, /*5*/0b1100, /*6*/0b0110, /*7*/0b0110,
            /*8*/0b0110, /*9*/0b0101, /*10*/0b1100, /*11*/0b1001,
            /*12*/0b0011, /*13*/0b1010, /*14*/0b1001, /*15*/0b0000
        };
    }
}